name: "xtts"
backend: "python"

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  },

  {
    name: "language"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "audio"
    data_type: TYPE_FP32
    dims: [1, -1]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]

max_batch_size: 0


model_transaction_policy {
  decoupled: true
}